In [1]:
0.9*1.3

1.1700000000000002

In [2]:
1.17**0.5

1.0816653826391966

In [2]:
100/(1.05)**2

90.70294784580499

In [6]:
1-1/(1+0.01)**120

0.6970052203139728

In [ ]:
1000*(1-1/(1+0.01)120)/0.01

In [12]:
10*(100*(4/9))/100-10*(100*(5/9))/100

-1.1111111111111107

Так как у нас курс о финансах, я вам раскрою секретный способ быстро узнать, при какой доходности ваш капитал удвоится. Надо 72 поделить на ожидаемую доходность. Если доходность 6 процентов, надо 72 поделить на 6, и мы получим 12, то есть при дохе в 6 % капитал удвоится за 12 лет. Для более точного результата надо брать 69, но 72 удобнее делить на разные числа. Да и, кстати, с 14 % инфляцией за 5 лет мы теряем половину капитала. Ну или зарплаты, если её пять лет не повышают.

In [13]:
72/14

5.142857142857143

In [20]:
((364/365)*(363/365))**22

0.8342383585863513

In [30]:
year = 365
p = 22
per = 364/365
for i in range(2,p+1):
    per *= (year-i)/year

1 - per

0.5072972343239857

In [ ]:
6*6*6

In [ ]:
0.5*0.5*0.5*0.5*0.5

In [2]:
k = 0.5
for i in range(9):
    k *= 0.5
k

0.0009765625

In [ ]:
0.5/10

In [1]:
1/2**10

0.0009765625

In [4]:
1/(2*10)

0.05

In [5]:
(3.5-1)**2+(3.5-2)**2+(3.5-3)**2+(4-3.5)**2+(5-3.5)**2+(6-3.5)**2=17.5, делим на 6 = 2.917.

SyntaxError: invalid character in identifier (<ipython-input-5-7bcca03e0239>, line 1)

In [6]:
(3.5-1)**2+(3.5-2)**2+(3.5-3)**2+(4-3.5)**2+(5-3.5)**2+(6-3.5)**2

17.5

In [1]:
import pandas as pd
from datetime import datetime

In [3]:
events_df = pd.read_csv('7_4_Events.csv')
events_df['year'] = pd.to_numeric(events_df['start_time'].str[:4])

In [4]:
purchase_df = pd.read_csv('7_4_Purchase.csv')

In [5]:
events_df['year'].value_counts()

2019    82767
2018    66952
2020    51210
2017    35814
2016    15591
Name: year, dtype: int64

In [6]:
events_df.head(10)

,id,event_type,selected_level,start_time,tutorial_id,user_id,year
0,28903,registration,NaN,2016-05-11T23:40:55,NaN,12583,2016
1,28904,registration,NaN,2016-05-11T23:49:58,NaN,12584,2016
2,28905,registration,NaN,2016-05-12T00:53:07,NaN,12585,2016
3,28906,tutorial_start,NaN,2016-05-12T01:32:20,17562.0,12585,2016
4,28907,tutorial_finish,NaN,2016-05-12T01:34:53,17562.0,12585,2016
5,28908,tutorial_start,NaN,2016-05-12T02:11:29,17563.0,12584,2016
6,28909,tutorial_finish,NaN,2016-05-12T02:14:14,17563.0,12584,2016
7,28910,level_choice,hard,2016-05-12T05:30:25,NaN,12584,2016
8,28911,pack_choice,NaN,2016-05-12T05:38:24,NaN,12584,2016
9,28912,tutorial_start,NaN,2016-05-12T07:19:01,17564.0,12583,2016

In [7]:
events_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252334 entries, 0 to 252333
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              252334 non-null  int64
 1   event_type      252334 non-null  object
 2   selected_level  31086 non-null   object
 3   start_time      252334 non-null  object
 4   tutorial_id     125103 non-null  float64
 5   user_id         252334 non-null  int64
 6   year            252334 non-null  int64
dtypes: float64(1), int64(3), object(3)
memory usage: 13.5+ MB

In [8]:
id_2018 = events_df['user_id'][(events_df['year'] == 2018)&(events_df['event_type'] == 'registration')]
n = id_2018.to_list()
events_df = events_df[events_df['user_id'].isin(n)]

In [9]:
purchase_df = purchase_df[purchase_df['user_id'].isin(n)]

In [10]:
events_df[events_df['event_type'] == 'level_choice'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8342 entries, 51424 to 118363
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              8342 non-null   int64
 1   event_type      8342 non-null   object
 2   selected_level  8342 non-null   object
 3   start_time      8342 non-null   object
 4   tutorial_id     0 non-null      float64
 5   user_id         8342 non-null   int64
 6   year            8342 non-null   int64
dtypes: float64(1), int64(3), object(3)
memory usage: 521.4+ KB

In [11]:
events_df[events_df['event_type'].isin(['tutorial_start','tutorial_finish'])].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32954 entries, 51412 to 118360
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              32954 non-null  int64
 1   event_type      32954 non-null  object
 2   selected_level  0 non-null      object
 3   start_time      32954 non-null  object
 4   tutorial_id     32954 non-null  float64
 5   user_id         32954 non-null  int64
 6   year            32954 non-null  int64
dtypes: float64(1), int64(3), object(3)
memory usage: 2.0+ MB

In [12]:
events_df.describe(include='all')

,id,event_type,selected_level,start_time,tutorial_id,user_id,year
count,66959.000000,66959,8342,66959,32954.000000,66959.000000,66959.000000
unique,NaN,5,3,66809,NaN,NaN,NaN
top,NaN,registration,medium,2018-03-13T09:37:43,NaN,NaN,NaN
freq,NaN,19926,4645,9,NaN,NaN,NaN
mean,113787.000045,NaN,NaN,NaN,40532.934393,37781.543362,2018.000105
std,19329.542752,NaN,NaN,NaN,5213.486632,5751.497904,0.010224
min,80308.000000,NaN,NaN,NaN,31505.000000,27832.000000,2018.000000
25%,97047.500000,NaN,NaN,NaN,36008.250000,32849.000000,2018.000000
50%,113787.000000,NaN,NaN,NaN,40529.500000,37719.000000,2018.000000
75%,130526.500000,NaN,NaN,NaN,45057.750000,42733.000000,2018.000000
max,147267.000000,NaN,NaN,NaN,49554.000000,47757.000000,2019.000000

In [13]:
events_df['event_type'].unique()

array(['registration', 'tutorial_start', 'tutorial_finish',
       'level_choice', 'pack_choice'], dtype=object)

In [14]:
events_df['selected_level'].unique()

array([nan, 'medium', 'hard', 'easy'], dtype=object)

In [15]:
events_df#.describe(include='all')

,id,event_type,selected_level,start_time,tutorial_id,user_id,year
51405,80308,registration,NaN,2018-01-01T03:48:40,NaN,27832,2018
51406,80309,registration,NaN,2018-01-01T04:07:25,NaN,27833,2018
51407,80310,registration,NaN,2018-01-01T08:35:10,NaN,27834,2018
51408,80311,registration,NaN,2018-01-01T11:54:47,NaN,27835,2018
51409,80312,registration,NaN,2018-01-01T13:28:07,NaN,27836,2018
...,...,...,...,...,...,...,...
118359,147262,tutorial_start,NaN,2019-01-01T03:26:18,49554.0,47756,2019
118360,147263,tutorial_finish,NaN,2019-01-01T03:29:25,49554.0,47756,2019
118362,147265,level_choice,easy,2019-01-01T05:04:52,NaN,47755,2019
118363,147266,level_choice,medium,2019-01-01T05:42:11,NaN,47756,2019
118364,147267,pack_choice,NaN,2019-01-01T05:50:36,NaN,47756,2019

In [16]:
purchase_df.describe(include='all')

                  id       user_id       event_datetime       amount
count    1600.000000   1600.000000                 1600  1600.000000
unique           NaN           NaN                 1600          NaN
top              NaN           NaN  2018-05-13T04:20:28          NaN
freq             NaN           NaN                    1          NaN
mean    17645.505625  37752.766250                  NaN   110.734375
std       462.038637   5822.621784                  NaN    54.696628
min     16845.000000  27845.000000                  NaN    25.000000
25%     17245.750000  32815.750000                  NaN    50.000000
50%     17645.500000  37633.500000                  NaN   100.000000
75%     18045.250000  43023.000000                  NaN   150.000000
max     18452.000000  47742.000000                  NaN   300.000000

----------------------------------------

In [17]:
event_tut = len(events_df[events_df['event_type']=='tutorial_start']['user_id'].unique())
event_reg = len(events_df[events_df['event_type']=='registration']['user_id'].unique())
event_tut_end = len(events_df[events_df['event_type']=='tutorial_finish']['user_id'].unique())
event_lvl = len(events_df[events_df['event_type']=='level_choice']['user_id'].unique())
event_pak = len(events_df[events_df['event_type']=='pack_choice']['user_id'].unique())
g = event_tut/event_reg
р = event_tut_end/event_tut
l = event_lvl/event_reg
k = event_pak/event_lvl
print('Процент пользователей, начавших обучение (от общего числа зарегистрированных) {:.2%}'.format(g))
print('Процент пользователей, закончивших обучение (от общего числа начавших обучение) {:.2%}'.format(р))
print('Процент пользователей, выбравших уровень сложности (от общего числа зарегистрированных) {:.2%}'.format(l))
print('Процент пользователей, выбравших бесплатный пак (от общего числа выбравших уровень сложности) {:.2%}'.format(k))

Процент пользователей, начавших обучение (от общего числа зарегистрированных) 59.51%
Процент пользователей, закончивших обучение (от общего числа начавших обучение) 86.44%
Процент пользователей, выбравших уровень сложности (от общего числа зарегистрированных) 41.86%
Процент пользователей, выбравших бесплатный пак (от общего числа выбравших уровень сложности) 68.77%

In [18]:
buy = len(purchase_df['user_id'].unique())
j = buy/event_pak
h = buy/event_reg
print('Процент пользователей, купивших пак (от общего числа выбравших бесплатный пак) {:.2%}'.format(j))
print('Процент пользователей, купивших пак (от общего числа зарегистрированных пользователей) {:.2%}'.format(h))

Процент пользователей, купивших пак (от общего числа выбравших бесплатный пак) 27.89%
Процент пользователей, купивших пак (от общего числа зарегистрированных пользователей) 8.03%

In [19]:
purchase_df['event_type'] = 'purchase'
events_df = events_df.rename(columns={'id':'event_id'})
purchase_df = purchase_df.rename(columns={'id':'purchase_id'})
total_events_df = pd.concat([events_df,purchase_df],sort=False)

In [20]:
total_events_df = total_events_df.reset_index(drop=True).sort_values('start_time')

In [21]:
total_events_df

,event_id,event_type,selected_level,start_time,tutorial_id,user_id,year,purchase_id,event_datetime,amount
0,80308.0,registration,NaN,2018-01-01T03:48:40,NaN,27832,2018.0,NaN,NaN,NaN
1,80309.0,registration,NaN,2018-01-01T04:07:25,NaN,27833,2018.0,NaN,NaN,NaN
2,80310.0,registration,NaN,2018-01-01T08:35:10,NaN,27834,2018.0,NaN,NaN,NaN
3,80311.0,registration,NaN,2018-01-01T11:54:47,NaN,27835,2018.0,NaN,NaN,NaN
4,80312.0,registration,NaN,2018-01-01T13:28:07,NaN,27836,2018.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
68554,NaN,purchase,NaN,NaN,NaN,47498,NaN,18441.0,2019-01-02T03:48:19,100.0
68555,NaN,purchase,NaN,NaN,NaN,47647,NaN,18442.0,2019-01-02T23:26:26,150.0
68556,NaN,purchase,NaN,NaN,NaN,47554,NaN,18443.0,2019-01-03T00:36:36,50.0
68557,NaN,purchase,NaN,NaN,NaN,47742,NaN,18448.0,2019-01-04T12:51:41,50.0
68558,NaN,purchase,NaN,NaN,NaN,47732,NaN,18452.0,2019-01-06T07:14:25,150.0

In [22]:
user_path_df = total_events_df.groupby(['user_id'])['event_type'].apply(list).reset_index()

In [23]:
user_path_df

       user_id                                         event_type
0        27832                                     [registration]
1        27833    [registration, tutorial_start, tutorial_finish]
2        27834    [registration, tutorial_start, tutorial_finish]
3        27835  [registration, tutorial_start, tutorial_finish...
4        27836  [registration, tutorial_start, tutorial_start,...
...        ...                                                ...
19921    47753  [registration, tutorial_start, tutorial_finish...
19922    47754                                     [registration]
19923    47755  [registration, tutorial_start, tutorial_finish...
19924    47756  [registration, tutorial_start, tutorial_finish...
19925    47757                                     [registration]

[19926 rows x 2 columns]

In [24]:
user_path_df['event_path'] = user_path_df['event_type'].apply(lambda x: ' > '.join(x))

In [25]:
user_path_df.head(10)

,user_id,event_type,event_path
0,27832,[registration],registration
1,27833,"[registration, tutorial_start, tutorial_finish]",registration > tutorial_start > tutorial_finish
2,27834,"[registration, tutorial_start, tutorial_finish]",registration > tutorial_start > tutorial_finish
3,27835,"[registration, tutorial_start, tutorial_finish...",registration > tutorial_start > tutorial_finis...
4,27836,"[registration, tutorial_start, tutorial_start,...",registration > tutorial_start > tutorial_start...
5,27837,[registration],registration
6,27838,[registration],registration
7,27839,"[registration, tutorial_start, tutorial_finish...",registration > tutorial_start > tutorial_finis...
8,27840,"[registration, tutorial_start, level_choice]",registration > tutorial_start > level_choice
9,27841,"[registration, tutorial_start, tutorial_finish]",registration > tutorial_start > tutorial_finish

In [26]:
user_paths = user_path_df.groupby(['event_path'])['user_id'].nunique().sort_values(ascending=False)

In [27]:
user_paths.head(10)

event_path
registration                                                                                                       7970
registration > tutorial_start > tutorial_finish > level_choice > pack_choice                                       2796
registration > tutorial_start > tutorial_finish                                                                    1956
registration > tutorial_start > tutorial_finish > level_choice                                                     1713
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > purchase                            1083
registration > tutorial_start                                                                                       842
registration > tutorial_start > level_choice > pack_choice                                                          346
registration > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish                                  323
registration > tutorial_start > level_choice                                                                        243
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > tutorial_finish     236
Name: user_id, dtype: int64

In [28]:
user_paths[user_paths.index.str.contains('purchase')].head(10)

event_path
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > purchase                                                                                                             1083
registration > tutorial_start > level_choice > pack_choice > purchase                                                                                                                                124
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > tutorial_finish > purchase                                                                           101
registration > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish > level_choice > pack_choice > purchase                                                                            52
registration > tutorial_start > tutorial_start > tutorial_finish > level_choice > pack_choice > purchase                                                                                              26
registration > level_choice > pack_choice > purchase                                                                                                                                                  22
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > purchase                                                                                              21
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish > purchase                                         12
registration > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > tutorial_finish > purchase                                          8
registration > tutorial_start > tutorial_finish > level_choice > pack_choice > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish > tutorial_start > tutorial_finish > purchase       7
Name: user_id, dtype: int64

In [29]:
registration_df = total_events_df[total_events_df['event_type']=='registration'] #регистрация

In [30]:
registration_df = registration_df[['user_id','start_time']].rename(columns={'start_time':'registration_time'})

In [31]:
tutorial_start_df = total_events_df[total_events_df['event_type'] == 'tutorial_start'] #начало обучения

In [32]:
tutorial_start_df['user_id'].value_counts().mean()

1.522179119581717

In [33]:
tutorial_start_df_wo_duplicates =  tutorial_start_df.sort_values('start_time').drop_duplicates('user_id')

In [34]:
tutorial_start_df_wo_duplicates['user_id'].value_counts().mean()

1.0

In [35]:
tutorial_start_df_wo_duplicates = tutorial_start_df_wo_duplicates[['user_id','tutorial_id','start_time']].rename(columns={'start_time':'tutorial_start_time'})

In [36]:
merged_df = registration_df.merge(tutorial_start_df_wo_duplicates, on='user_id',how='inner')

In [37]:
merged_dfhh = purchase_df.merge(tutorial_start_df_wo_duplicates, on='user_id',how='inner')

In [38]:
merged_dfhh

,purchase_id,user_id,event_datetime,amount,event_type,tutorial_id,tutorial_start_time
0,16845,27845,2018-01-03T18:53:43,100,purchase,31512.0,2018-01-02T03:03:44
1,16846,27865,2018-01-04T14:46:10,250,purchase,31541.0,2018-01-03T23:30:17
2,16848,27911,2018-01-07T08:19:12,50,purchase,31566.0,2018-01-05T14:00:00
3,16849,27910,2018-01-07T12:11:34,100,purchase,31565.0,2018-01-05T11:50:06
4,16850,27940,2018-01-07T13:16:41,200,purchase,31585.0,2018-01-05T23:51:37
...,...,...,...,...,...,...,...
1573,18441,47498,2019-01-02T03:48:19,100,purchase,49356.0,2018-12-26T11:53:53
1574,18442,47647,2019-01-02T23:26:26,150,purchase,49472.0,2018-12-28T13:46:03
1575,18443,47554,2019-01-03T00:36:36,50,purchase,49386.0,2018-12-26T23:33:55
1576,18448,47742,2019-01-04T12:51:41,50,purchase,49544.0,2018-12-31T02:43:26
1577,18452,47732,2019-01-06T07:14:25,150,purchase,49549.0,2018-12-31T07:14:38

In [39]:
merged_df

       user_id    registration_time  tutorial_id  tutorial_start_time
0        27833  2018-01-01T04:07:25      31508.0  2018-01-01T17:47:40
1        27834  2018-01-01T08:35:10      31510.0  2018-01-01T19:46:11
2        27835  2018-01-01T11:54:47      31506.0  2018-01-01T15:00:51
3        27836  2018-01-01T13:28:07      31505.0  2018-01-01T14:54:40
4        27839  2018-01-01T18:24:01      31509.0  2018-01-01T19:11:36
...        ...                  ...          ...                  ...
11853    47748  2018-12-31T03:29:04      49546.0  2018-12-31T04:11:31
11854    47751  2018-12-31T13:55:01      49551.0  2018-12-31T19:38:14
11855    47753  2018-12-31T18:58:55      49552.0  2018-12-31T20:54:56
11856    47755  2018-12-31T21:15:14      49553.0  2019-01-01T00:08:14
11857    47756  2018-12-31T23:17:30      49554.0  2019-01-01T03:26:18

[11858 rows x 4 columns]

In [40]:
merged_df['tutorial_start_time'] = pd.to_datetime(merged_df['tutorial_start_time'],format='%Y-%m-%dT%H:%M:%S')

In [41]:
merged_df['registration_time'] = pd.to_datetime(merged_df['registration_time'],format='%Y-%m-%dT%H:%M:%S')

In [42]:
merged_df['timedelta'] = merged_df['tutorial_start_time'] - merged_df['registration_time']

In [43]:
merged_df['timedelta'].describe()

count                        11858
mean     0 days 04:38:24.019817844
std      0 days 04:15:09.650705034
min                0 days 00:00:34
25%         0 days 01:21:37.500000
50%         0 days 03:22:08.500000
75%         0 days 06:47:42.750000
max                1 days 16:03:46
Name: timedelta, dtype: object

In [44]:
tutorial_finish_df = total_events_df[total_events_df['event_type'] == 'tutorial_finish'] #конец обучения

In [45]:
first_tutorial_ids = tutorial_start_df_wo_duplicates['tutorial_id'].unique()

In [46]:
tutorial_finish_df = tutorial_finish_df[tutorial_finish_df['tutorial_id'].isin(first_tutorial_ids)]

In [47]:
tutorial_finish_df['user_id'].value_counts().mean()

1.0

In [48]:
tutorial_finish_df = tutorial_finish_df[['user_id','start_time']].rename(columns={'start_time':'tutorial_finish_time'})

In [49]:
tutorial_finish_df['tutorial_finish_time'] = pd.to_datetime(tutorial_finish_df['tutorial_finish_time'],format='%Y-%m-%dT%H:%M:%S')

In [50]:
merged_df_2 = tutorial_start_df_wo_duplicates.merge(tutorial_finish_df,on='user_id',how='inner')

In [51]:
merged_df_2['tutorial_start_time'] = pd.to_datetime(merged_df_2['tutorial_start_time'],format='%Y-%m-%dT%H:%M:%S')

In [52]:
merged_df_2['timedelta'] = merged_df_2['tutorial_finish_time'] - merged_df_2['tutorial_start_time']

In [53]:
print(merged_df_2['timedelta'].mean())
print(merged_df_2['timedelta'].describe())

0 days 00:03:53.174160732
count                         9830
mean     0 days 00:03:53.174160732
std      0 days 00:01:44.803217992
min                0 days 00:00:16
25%                0 days 00:02:28
50%                0 days 00:03:42
75%                0 days 00:05:08
max                0 days 00:10:06
Name: timedelta, dtype: object

In [54]:
level_choice_df = total_events_df[total_events_df['event_type'] == 'level_choice'] #выбор уровня сложности
print(level_choice_df['user_id'].value_counts().mean())
level_choice_df = level_choice_df[['user_id','start_time']].rename(columns={'start_time':'level_choice_time'})
merged_df_3 = registration_df.merge(level_choice_df,on='user_id',how='inner')

1.0

In [55]:
merged_df_3['registration_time'] = pd.to_datetime(merged_df_3['registration_time'],format='%Y-%m-%dT%H:%M:%S')

In [56]:
merged_df_3['level_choice_time'] = pd.to_datetime(merged_df_3['level_choice_time'],format='%Y-%m-%dT%H:%M:%S')

In [57]:
merged_df_3['timedelta'] = merged_df_3['level_choice_time'] - merged_df_3['registration_time']
print(merged_df_3['timedelta'].mean())
print(merged_df_3['timedelta'].describe())

0 days 07:10:19.169863342
count                         8342
mean     0 days 07:10:19.169863342
std      0 days 04:33:51.164488800
min                0 days 00:08:15
25%         0 days 03:53:16.500000
50%                0 days 06:03:28
75%         0 days 09:34:58.500000
max                1 days 18:48:25
Name: timedelta, dtype: object

In [58]:
total_events_df['event_type'].value_counts()

registration       19926
tutorial_start     18050
tutorial_finish    14904
level_choice        8342
pack_choice         5737
purchase            1600
Name: event_type, dtype: int64

In [59]:
level_choice_df = total_events_df[total_events_df['event_type']=='level_choice']

In [60]:
level_choice_df = level_choice_df[['user_id','start_time']].rename(columns={'start_time':'level_choice_time'})

In [61]:
level_choice_df['level_choice_time'] = pd.to_datetime(level_choice_df['level_choice_time'],format='%Y-%m-%dT%H:%M:%S')

In [62]:
level_choice_df['user_id'].value_counts().mean()

1.0

In [63]:
pack_choice_df = total_events_df[total_events_df['event_type']=='pack_choice']
pack_choice_df = pack_choice_df[['user_id','start_time']].rename(columns={'start_time':'pack_choice_time'})
pack_choice_df['pack_choice_time'] = pd.to_datetime(pack_choice_df['pack_choice_time'],format='%Y-%m-%dT%H:%M:%S')

In [64]:
pack_choice_df['user_id'].value_counts().mean()

1.0

In [65]:
merged_df_4 = level_choice_df.merge(pack_choice_df,on='user_id',how='inner')

In [66]:
merged_df_4['timedelta'] = merged_df_4['pack_choice_time'] - merged_df_4['level_choice_time']

In [67]:
merged_df_4['timedelta'].mean()

Timedelta('0 days 00:05:17.128464354')

In [68]:
purchase_df = total_events_df[total_events_df['event_type']=='purchase']
purchase_df = purchase_df[['user_id','event_datetime','amount']].rename(columns={'event_datetime':'purchase_time'})
purchase_df['purchase_time'] = pd.to_datetime(purchase_df['purchase_time'],format='%Y-%m-%dT%H:%M:%S')

In [69]:
purchase_df

       user_id       purchase_time  amount
66959    27845 2018-01-03 18:53:43   100.0
66960    27865 2018-01-04 14:46:10   250.0
66961    27911 2018-01-07 08:19:12    50.0
66962    27910 2018-01-07 12:11:34   100.0
66963    27940 2018-01-07 13:16:41   200.0
...        ...                 ...     ...
68554    47498 2019-01-02 03:48:19   100.0
68555    47647 2019-01-02 23:26:26   150.0
68556    47554 2019-01-03 00:36:36    50.0
68557    47742 2019-01-04 12:51:41    50.0
68558    47732 2019-01-06 07:14:25   150.0

[1600 rows x 3 columns]

In [70]:
purchase_df['user_id'].value_counts().mean()

1.0

In [71]:
merged_df_5 = pack_choice_df.merge(purchase_df,on='user_id',how='inner')

In [72]:
merged_df_5['timedelta'] = merged_df_5['purchase_time'] - merged_df_5['pack_choice_time']

In [73]:
merged_df_5['timedelta'].mean()

Timedelta('3 days 17:46:53.403125')

In [74]:
users_with_finished_tutorial = total_events_df[total_events_df['event_type']=='tutorial_finish']['user_id'].unique()

In [75]:
print(len(users_with_finished_tutorial))

10250

In [76]:
users_with_started_tutorial = total_events_df[total_events_df['event_type'] == 'tutorial_start']['user_id'].unique()

In [77]:
set_users_with_started_tutorial = set(users_with_started_tutorial)
set_users_not_finished_but_started_tutorial = set_users_with_started_tutorial.difference(set(users_with_finished_tutorial))

print(len(set_users_with_started_tutorial))
print(len(set_users_not_finished_but_started_tutorial))
print (len(set_users_with_started_tutorial) - len(set(users_with_finished_tutorial)) == \
len(set_users_not_finished_but_started_tutorial))

11858
1608
True

In [78]:
all_users = total_events_df['user_id'].unique()
set_all_users = set(all_users)
set_users_not_started_tutorial = set_all_users.difference(set_users_with_started_tutorial)
print (len(set_users_not_started_tutorial))
print (len(set_all_users)-len(set_users_with_started_tutorial) == len(set_users_not_started_tutorial))

8068
True

In [79]:
len(set_users_not_started_tutorial)  + len(set_users_not_finished_but_started_tutorial) + len(set(users_with_finished_tutorial))  == len(set_all_users)

True

In [80]:
len(set_users_not_finished_but_started_tutorial) + len(set_users_not_started_tutorial) + len(users_with_finished_tutorial) == len(set_all_users)

True

In [81]:
purchase_df_1 = purchase_df[purchase_df['user_id'].isin(users_with_finished_tutorial)]

In [82]:
purchase_df_1['user_id'].nunique()

1447

In [83]:
percent_of_purchase_1 = purchase_df_1['user_id'].nunique()/len(users_with_finished_tutorial)
print ('Процент пользователей, которые оплатили тренировки (от числа пользователей, завершивших обучение): {:.2%}'.format(percent_of_purchase_1))

Процент пользователей, которые оплатили тренировки (от числа пользователей, завершивших обучение): 14.12%

In [84]:
purchase_df_1['amount'].mean()

110.98825155494126

In [85]:
purchase_df_2 = purchase_df[purchase_df['user_id'].isin(set_users_not_finished_but_started_tutorial)]
print(purchase_df_2['user_id'].nunique())
percent_of_purchase_2 = purchase_df_2['user_id'].nunique()/len(set_users_not_finished_but_started_tutorial)
print ('Процент пользователей, которые оплатили тренировки (от числа пользователей, начавших обучение, но не завершивших): {:.2%}'.format(percent_of_purchase_2))

131
Процент пользователей, которые оплатили тренировки (от числа пользователей, начавших обучение, но не завершивших): 8.15%

In [86]:
purchase_df_2['amount'].mean()

104.9618320610687

In [87]:
purchase_df_3 = purchase_df[purchase_df['user_id'].isin(set_users_not_started_tutorial)]
print(purchase_df_3['user_id'].nunique())
percent_of_purchase_2 = purchase_df_3['user_id'].nunique()/len(set_users_not_started_tutorial)
print ('Процент пользователей, которые оплатили тренировки (от числа пользователей, не начавших обучение): {:.2%}'.format(percent_of_purchase_2))

22
Процент пользователей, которые оплатили тренировки (от числа пользователей, не начавших обучение): 0.27%

In [88]:
purchase_df_3['amount'].mean()

128.4090909090909

In [ ]:
tutorial_finish_time_df=tutorial_finish_total_events_df.pivot_table(values=['start_time'], index=['user_id'], columns=['event_type'], aggfunc='min')
tutorial_not_start_time_df=tutorial_not_start_total_events_df.pivot_table(values=['start_time'], index=['user_id'], columns=['event_type'], aggfunc='min')


#tutorial_finish_pack_choice = tutorial_finish_time_df['start_time','pack_choice'].reset_index()
tutorial_finish_time_df.columns = [tup[1] if tup[1] else tup[0] for tup in tutorial_finish_time_df.columns]
#tutorial_finish_time_df.columns = tutorial_finish_time_df.columns.droplevel('level_1')
purchase_tutorial_finish_df = tutorial_finish_time_df.merge(purchase_df,on='user_id',how='inner')

display(purchase_tutorial_finish_df)
#display(tutorial_not_start_time_df)

In [ ]:
pack_choice_df = total_events_df[total_events_df['event_type']=='pack_choice']
pack_choice_df = pack_choice_df[['user_id','start_time']].rename(columns={'start_time':'pack_choice_time'})
#events_registration_df = events_df[events_df['event_type']=='registration']
#events_purchase_registration_df = events_registration_df[['user_id','start_time']].rename(columns={'start_time':'registration_time'})
purchase_registration_df = pack_choice_df.merge(purchase_df,on='user_id',how='inner')
purchase_registration_df['timedelta'] = purchase_registration_df['event_datetime'] - purchase_registration_df['pack_choice_time']
purchase_registration_df['timedelta'].mean()

In [ ]:
len(purchase_registration_df)

In [ ]:
x = events_df.pivot_table(values=['start_time'], index=['user_id'], columns=['event_type'], aggfunc='min')
x.columns = [tup[1] if tup[1] else tup[0] for tup in x.columns]
x = x.merge(purchase_df,on='user_id',how='inner')
x['timedelta'] = x['event_datetime'] - x['pack_choice']
x['timedelta'].mean()

In [ ]:
registration_df = total_events_df[total_events_df['event_type']=='registration']
registration_df = registration_df[['user_id','start_time']].rename(columns={'start_time':'registration_time'})
tutorial_start_df_wo_duplicates = total_events_df[total_events_df['event_type'] == 'tutorial_start']
tutorial_start_df_wo_duplicates = tutorial_start_df_wo_duplicates.drop_duplicates('user_id')
tutorial_start_df = tutorial_start_df_wo_duplicates[['user_id','start_time']].rename(columns={'start_time':'tutorial_start_time'})
purchase_registration_df = tutorial_start_df.merge(registration_df,on='user_id',how='inner')
purchase_registration_df['timedelta'] = purchase_registration_df['tutorial_start_time'] - purchase_registration_df['registration_time']
purchase_registration_df['timedelta'].mean()

In [ ]:
x = events_df.pivot_table(values=['start_time'], index=['user_id'], columns=['event_type'], aggfunc='min')
x.columns = [tup[1] if tup[1] else tup[0] for tup in x.columns]

x = x.merge(tutorial_start_df['user_id'],on='user_id',how='inner')
#x = x[x['user_id'].isin(tutorial_start_df_wo_duplicates)]
x['timedelta'] = x['tutorial_start'] - x['registration']
x['timedelta'].mean()

In [ ]:
x = events_df.pivot_table(values=['start_time'], index=['user_id'], columns=['event_type'], aggfunc='min')
x.columns = [tup[1] if tup[1] else tup[0] for tup in x.columns]
tutorial_start_df_wo_duplicates = events_df[events_df['event_type'] == 'tutorial_start']
tutorial_start_df_wo_duplicates = tutorial_start_df_wo_duplicates.drop_duplicates('user_id')['user_id']
x = x.merge(tutorial_start_df_wo_duplicates,on='user_id',how='inner')
x = x[x['user_id'].isin(tutorial_start_df_wo_duplicates)]
x['timedelta'] = x['tutorial_start'] - x['registration']
x['timedelta'].mean()

In [ ]:
len(x)

In [ ]:
len(purchase_registration_df)

In [ ]:
tutorial_start_df_wo_duplicates = total_events_df[total_events_df['event_type'] == 'tutorial_start']
tutorial_start_df_wo_duplicates = tutorial_start_df_wo_duplicates.drop_duplicates('user_id')
tutorial_start_df_wo_duplicates = tutorial_start_df_wo_duplicates['user_id']
#x = x[x['user_id'].isin(tutorial_start_df_wo_duplicates)]
#x['timedelta'] = x['tutorial_start'] - x['registration']
#x['timedelta'].mean()

In [90]:
ratings_df = pd.read_csv('ratings.csv')
movies_df = pd.read_csv('movies.csv')

In [93]:
ratings_df[ratings_df.rating == 0.5].count()

userId       1370
movieId      1370
rating       1370
timestamp    1370
dtype: int64

In [9]:
movies_df

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [94]:
joined = ratings_df.merge(movies_df,how='outer',on='movieId')

In [96]:
joined[joined.movieId==3456]

,userId,movieId,rating,timestamp,title,genres
100839,NaN,3456,NaN,NaN,"Color of Paradise, The (Rang-e khoda) (1999)",Drama

In [25]:
from numpy import nan

In [27]:
joined[joined.rating.isnull()]

,userId,movieId,rating,timestamp,title,genres
100836,NaN,1076,NaN,NaN,"Innocents, The (1961)",Drama|Horror|Thriller
100837,NaN,2939,NaN,NaN,Niagara (1953),Drama|Thriller
100838,NaN,3338,NaN,NaN,For All Mankind (1989),Documentary
100839,NaN,3456,NaN,NaN,"Color of Paradise, The (Rang-e khoda) (1999)",Drama
100840,NaN,4194,NaN,NaN,I Know Where I'm Going! (1945),Drama|Romance|War
100841,NaN,5721,NaN,NaN,"Chosen, The (1981)",Drama
100842,NaN,6668,NaN,NaN,"Road Home, The (Wo de fu qin mu qin) (1999)",Drama|Romance
100843,NaN,6849,NaN,NaN,Scrooge (1970),Drama|Fantasy|Musical
100844,NaN,7020,NaN,NaN,Proof (1991),Comedy|Drama|Romance
100845,NaN,7792,NaN,NaN,"Parallax View, The (1974)",Thriller
100846,NaN,8765,NaN,NaN,This Gun for Hire (1942),Crime|Film-Noir|Thriller
100847,NaN,25855,NaN,NaN,"Roaring Twenties, The (1939)",Crime|Drama|Thriller
100848,NaN,26085,NaN,NaN,Mutiny on the Bounty (1962),Adventure|Drama|Romance
100849,NaN,30892,NaN,NaN,In the Realms of the Unreal (2004),Animation|Documentary
100850,NaN,32160,NaN,NaN,Twentieth Century (1934),Comedy
100851,NaN,32371,NaN,NaN,Call Northside 777 (1948),Crime|Drama|Film-Noir
100852,NaN,34482,NaN,NaN,"Browning Version, The (1951)",Drama
100853,NaN,85565,NaN,NaN,Chalet Girl (2011),Comedy|Romance

In [32]:
len(ratings_df) == len(joined)

True

In [33]:
import pandas as pd
ratings = pd.read_csv('ratings_example.txt', sep = '\t')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [34]:
movies = pd.read_csv('movies_example.txt', sep = '\t')
movies.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [37]:
ratings.merge(movies, on = 'movieId', how = 'inner')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [38]:
ratings.merge(movies, how = 'left', on = 'movieId')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [39]:
movies.drop_duplicates(subset = 'movieId', keep = 'first', inplace = True)
movies.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller

In [40]:
ratings.merge(movies, how = 'left', on = 'movieId')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [41]:
items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}

In [42]:
purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}

In [43]:
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

In [49]:
joins = items_df.merge(purchase_df,how='inner',on='item_id')

In [51]:
joins['pr'] = joins['stock_count']*joins['price']#[joins.stock_count.isnull()]

In [55]:
joins.pr.sum()

19729490

In [56]:
import os

In [58]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']

In [70]:
data = []
for i in files:
    #print(i[-4:])
    if i[-4:] == '.txt':
        data.append(i)
data

ratings.txt
stock_stats.txt
movies.txt

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [86]:
files = os.listdir('data')
files

['ratings_1.txt',
 'ratings_10.txt',
 'ratings_2.txt',
 'ratings_3.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_6.txt',
 'ratings_7.txt',
 'ratings_8.txt',
 'ratings_9.txt']

In [87]:
data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])

In [88]:
for i in files:
    temp = pd.read_csv( os.path.join('data', i), names = ['userId', 'movieId', 'rating', 'timestamp'] )
    data = pd.concat([data, temp])
data

     userId movieId  rating   timestamp
0         1      31     2.5  1260759144
1         1    1029     3.0  1260759179
2         1    1061     3.0  1260759182
3         1    1129     2.0  1260759185
4         1    1172     4.0  1260759205
...     ...     ...     ...         ...
9995    597    2572     3.0   940707828
9996    597    2613     3.0   940707355
9997    597    2657     4.0   940707124
9998    597    2661     4.0   940707609
9999    597    2662     3.0   940707473

[100004 rows x 4 columns]

In [72]:
temp = pd.read_csv( os.path.join('data', filename), names = ['userId', 'movieId', 'rating', 'timestamp'] )

NameError: name 'filename' is not defined

In [ ]:
data = pd.concat([data, temp])

In [2]:
import pandas as pd
log = pd.read_csv('log.csv')

In [6]:
log.sample(15)

,Запись пользователя № - user_919,[2019-01-01 14:06:51,Unnamed: 2,Unnamed: 3
722,Запись пользователя № - user_953,[2019-03-21 0:33:37,400.0,NaN
872,Запись пользователя № - user_978,[2019-04-08 0:36:28,1000.0,NaN
729,Запись пользователя № - user_938,[2019-03-21 4:38:31,900.0,6080.0
561,Запись пользователя № - user_900,[2019-03-02 22:05:45,300.0,NaN
90,Запись пользователя № - user_900,[2019-01-09 3:05:07,NaN,NaN
983,Запись пользователя № - user_925,[2019-04-20 12:55:00,1000.0,NaN
492,Запись пользователя № - user_993,[2019-02-23 3:51:41,NaN,NaN
2,Запись пользователя № - user_954,[2019-01-01 17:17:51,NaN,NaN
98,Запись пользователя № - user_991,[2019-01-10 3:55:38,NaN,NaN
860,Запись пользователя № - user_907,[2019-04-06 0:58:25,600.0,NaN
551,Запись пользователя № - user_986,[2019-03-01 12:09:15,200.0,NaN
675,Запись пользователя № - user_988,[2019-03-15 7:15:25,NaN,NaN
920,Запись пользователя № - user_950,[2019-04-13 6:25:18,600.0,5340.0
53,Запись пользователя № - user_943,[2019-01-06 21:06:57,NaN,NaN
468,Запись пользователя № - user_979,[2019-02-20 15:03:15,100.0,3691.0

In [3]:
!ls -l

итого 309328
-rwxrwx--- 1 fktr0 fktr0   737729 окт 25 17:42 '10.6. PRACTICE. Анализ данных.ipynb'
-rwxrwx--- 1 fktr0 fktr0    20964 окт 25 18:38 '10.7. PROJECT.ipynb'
-rwxrwx--- 1 fktr0 fktr0 13363501 фев 23  2021  7_4_Events.csv
-rwxrwx--- 1 fktr0 fktr0   218577 фев 23  2021  7_4_Purchase.csv
-rwxrwx--- 1 fktr0 fktr0    95167 окт 25 18:40  9.10.PROJECT.ipynb
-rwxrwx--- 1 fktr0 fktr0 16196410 июл 26 15:49 'ab_data - ab_data.csv'
-rwxrwx--- 1 fktr0 fktr0 15531676 июл 27 13:01  ab_data_practice.csv
-rwxrwx--- 1 fktr0 fktr0  2179048 апр 25  2021  ab_test_groups.csv
-rwxrwx--- 1 fktr0 fktr0   110152 окт 25 18:24 'A_B_ test.ipynb'
-rw-rw-r-- 1 fktr0 fktr0    16176 окт 31 08:28  Admission_Predict_Ver1.1.csv
-rwxrwx--- 1 fktr0 fktr0    10650 окт 25 18:26 'Case 8 Reference.ipynb'
-rwxrwx--- 1 fktr0 fktr0      221 июл 27 16:11  cuped_example.csv
drwxrwx--- 2 fktr0 fktr0     4096 июл  6 18:12  data
-rwxrwx--- 1 fktr0 fktr0   208830 июн 17 12:13  data.csv
-rwxrwx--- 1 fktr0 fktr0    14751 янв  5  2021  data.json
-rwxrwx--- 1 fktr0 fktr0 50716025 авг  9 15:19  ecom_data.csv
-rwxrwx--- 1 fktr0 fktr0 45656257 авг  9 15:47  ecom_data_students.csv
-rwxrwx--- 1 fktr0 fktr0 13363501 фев 21  2021  Events.csv
-rwxrwx--- 1 fktr0 fktr0        6 сен 16 19:29  ff.sql
-rwxrwx--- 1 fktr0 fktr0  1720977 окт 25 18:25  Fibonacci.ipynb
-rwxrwx--- 1 fktr0 fktr0    68475 янв 10  2021 'First notebook.ipynb'
-rwxrwx--- 1 fktr0 fktr0    18376 авг  8 10:34  for_task.csv
-rwxrwx--- 1 fktr0 fktr0 75737800 июл 31 15:55  free_throws.csv
-rwxrwx--- 1 fktr0 fktr0    15962 окт 25 18:26  GD-3_Zhitkova_Marina.ipynb
-rw-rw-r-- 1 fktr0 fktr0   497985 ноя  7 16:09  Gradient_Descent.ipynb
-rw-rw-r-- 1 fktr0 fktr0    12352 ноя  7 12:44  Linear_Programming.ipynb
-rwxrwx--- 1 fktr0 fktr0    76805 мар 22  2021  log.csv
-rwxrwx--- 1 fktr0 fktr0    62711 окт 25 18:27  Maliarenko_A_R_PROJECT_7_10.ipynb
-rw-rw-r-- 1 fktr0 fktr0     5850 окт 25 10:51  Module_1_Matrix_Base_screencast.ipynb
-rw-rw-r-- 1 fktr0 fktr0     6374 окт 26 18:01  Module_1_Matrix_Inverse_screencast.ipynb
-rw-rw-r-- 1 fktr0 fktr0     6017 окт 26 11:44  Module_1_Matrix_Mult_screencast.ipynb
-rw-rw-r-- 1 fktr0 fktr0     2482 окт 31 16:11  Module_1_notebook.ipynb
-rw-rw-r-- 1 fktr0 fktr0    17809 окт 25 07:22  Module_1_Vectors_screencast.ipynb
-rwxrwx--- 1 fktr0 fktr0   494431 мар 19  2021  movies.csv
-rwxrwx--- 1 fktr0 fktr0      160 мар 20  2021  movies_example.txt
-rwxrwx--- 1 fktr0 fktr0    16885 янв 26  2021  Notebook-Python-4-identification.ipynb
-rwxrwx--- 1 fktr0 fktr0    21144 янв 26  2021  Notebook-Python-4-operations.ipynb
-rwxrwx--- 1 fktr0 fktr0   368111 янв 28  2021  Notebook-Python-5.ipynb
-rwxrwx--- 1 fktr0 fktr0    64801 апр  1  2021 'numpy as np.ipynb'
-rwxrwx--- 1 fktr0 fktr0    74353 апр 27  2021  od3_ab-test_work.ipynb
-rwxrwx--- 1 fktr0 fktr0    91281 окт 25 18:31 'OD-3 Zhitkova_Marina.ipynb'
-rw-rw-r-- 1 fktr0 fktr0    18608 окт 31 07:56  OLS_classic_screencast.ipynb
-rwxrwx--- 1 fktr0 fktr0    57379 окт 25 18:34 'On-demand 1 my project.ipynb'
-rwxrwx--- 1 fktr0 fktr0      647 авг 16 21:42  PA_15_ab_test_results.csv
-rwxrwx--- 1 fktr0 fktr0   706503 апр 25  2021  payments.csv
-rwxrwx--- 1 fktr0 fktr0    13478 фев 27  2021  penguins.csv
-rwxrwx--- 1 fktr0 fktr0    98192 окт 25 18:37  Plotly.ipynb
-rwxrwx--- 1 fktr0 fktr0 47619733 окт 25 18:40 'Plotly Tut.ipynb'
-rwxrwx--- 1 fktr0 fktr0    42306 окт 25 19:17  project_11_8.ipynb
-rwxrwx--- 1 fktr0 fktr0   160624 окт 25 18:41 'Project 2 fktr00 (2).ipynb'
-rwxrwx--- 1 fktr0 fktr0   160400 окт 25 18:41 'Project 2 fktr00.ipynb'
-rwxrwx--- 1 fktr0 fktr0   165508 окт 25 19:18 'PROJECT_2_Maliarnko_DAPR_17 (2).ipynb'
-rwxrwx--- 1 fktr0 fktr0   165398 окт 25 19:18  PROJECT_2_Maliarnko_DAPR_17.ipynb
-rwxrwx--- 1 fktr0 fktr0    55632 окт 25 19:19  PROJECT_3_DAPR17_Maliarenko.ipynb
-rwxrwx--- 1 fktr0 fktr0   809126 окт 25 19:38 'PROJEKT-1 fktr00@mail.ru.ipynb'
-rwxrwx--- 1 fktr0 fktr0   218577 фев 21  2021  purchase.csv
-rwxrwx--- 1 fktr0 fktr0  2483723 мар 19  2021  ratings.csv
-rwxrwx--- 1 fktr0 fktr0       54 мар 20  2021  ratings_example.txt
-rwxrwx--- 1 fktr0 fktr0    60996 окт 25 19:20  requests_parsing.ipynb
-rwxrwx--- 1 fktr0 fktr0 18757921 июн 17 13:27  RFM201810.csv
-rwxrwx--- 1 fktr0 fktr0   383461 окт 25 19:21  rfm.ipynb
-rwxrwx--- 1 fktr0 fktr0   649259 апр 13  2021 'SF_OD2_10.6 (1).ipynb'
-rwxrwx--- 1 fktr0 fktr0    31442 апр  8  2021  SF_OD2_10.7_answer.ipynb
-rwxrwx--- 1 fktr0 fktr0    91148 апр 27  2021  SF_OD3_11.8_answer.ipynb
-rwxrwx--- 1 fktr0 fktr0    18001 апр  1  2021  sf_test_SQL.ipynb
-rwxrwx--- 1 fktr0 fktr0       72 мар 18  2021  token.ipynb
-rwxrwx--- 1 fktr0 fktr0     2531 мар 10  2021  try_except.ipynb
-rwxrwx--- 1 fktr0 fktr0     4849 июл  7 00:19  turtle.ipynb
-rwxrwx--- 1 fktr0 fktr0  1861274 июл 14 15:47  Untitled1.ipynb
-rwxrwx--- 1 fktr0 fktr0     5146 июн 30 17:58  Untitled.ipynb
-rwxrwx--- 1 fktr0 fktr0     1872 авг 19 12:52  users_channel_groups_data.csv
-rwxrwx--- 1 fktr0 fktr0     3875 мар 22  2021  users.csv
-rwxrwx--- 1 fktr0 fktr0   149455 ноя 11 13:58  uuuf.ipynb
-rwxrwx--- 1 fktr0 fktr0     5046 июн 24 14:30  Визуализация.ipynb
-rwxrwx--- 1 fktr0 fktr0     5532 июн 26 23:53  выаыва.ipynb
-rwxrwx--- 1 fktr0 fktr0  2900555 июн 30 18:01  ЗАДАНИЕ5.2.2.СРЕДНЯЯ_ЗАРПЛАТА.ipynb
-rw-rw-r-- 1 fktr0 fktr0   698914 ноя  9 06:55 'Конспект линейная алгебра.ipynb'
-rwxrwx--- 1 fktr0 fktr0   283425 авг 19 12:55 'Мат статистика abtest.ipynb'